""" 0.Запустите
print("Hello, world!")
С этого начинается изучение любого языка программирования, это традиция"""
#
#
# print("Hello world!")


""" 1.Создайте переменные a и b, присвойте им значения 10 и 20 соответственно.
Выполните сложение, вычитание, умножение и деление этих переменных и выведите
результаты."""
#
#
# a = 10
# b = 20

# sum_num = a + b
# sub_num = a - b
# mult_num = a * b
# div_num = a / b

# print(sum_num, sub_num, mult_num, div_num)


""" 2.Создайте переменную text со значением "Python". 
Умножьте эту строку на 3 и выведите результат."""
#
#
# text = "Python"
# print(text * 3)


""" 3.Создайте переменную name со значением вашего имени и переменную age с вашим возрастом. 
Создайте строку, которая будет содержать сообщение вида "Меня зовут [имя], мне [возраст] 
лет." и выведите ее."""
#
#
# name = 'Artur'
# age = 30

# print("Меня зовут " + name + ", мне " + str(age) + " лет")


""" 4.Напишите программу, которая считает выражение (5 + 3) * 2 ** 2 
и выводит результат."""
#
#
# result = (5 + 3) * 2 ** 2

# print(result)


""" 5.Попробуйте сложить строку и число без приведения типов и исправьте ошибку, 
используя явное преобразование типов."""
#
#
# name = 'Bob'
# age = 30
# sum_str_num = name + str(age)

# print(sum_str_num)


""" 6.Сделать задачи 1, 2, 3 при помощи input"""
#
#
# a = input("Enter number 10:  ")
# b = input("Enter number 20:  ")

# sum_num = int(a) + int(b)
# sub_num = int(a) - int(b)
# mult_num = int(a) * int(b)
# div_num = int(a) / int(b)

# print(sum_num, sub_num, mult_num, div_num)
#
#
# text = input("Enter text Python: ")
# print(text * 3)
#
#
# name = input("Enter your name ")
# age = input("Enter your age ")

# print("Меня зовут " + name + ", мне " + str(age) + " лет")
